import { useAppContext } from "../context/app.context";

export default function Humburger({ styles }) {
  const { menuIsOpen, setMenuIsOpen } = useAppContext();

  return (
    <button
      className={styles}
      onClick={() => setMenuIsOpen(!menuIsOpen)}
      aria-label="Открыть меню сайта"
    >
      {!menuIsOpen ? (
        <svg
          width="26"
          viewBox="0 0 48 37"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M0 35.5C0 34.9439 0.448856 34.5 1.00255 34.5H46.9975C47.5555 34.5 48 34.9477 48 35.5C48 36.0561 47.5511 36.5 46.9975 36.5H1.00255C0.444531 36.5 0 36.0523 0 35.5ZM0 18.5C0 17.9439 0.448856 17.5 1.00255 17.5H46.9975C47.5555 17.5 48 17.9477 48 18.5C48 19.0561 47.5511 19.5 46.9975 19.5H1.00255C0.444531 19.5 0 19.0523 0 18.5ZM0 1.5C0 0.943865 0.448856 0.5 1.00255 0.5H46.9975C47.5555 0.5 48 0.947715 48 1.5C48 2.05614 47.5511 2.5 46.9975 2.5H1.00255C0.444531 2.5 0 2.05228 0 1.5Z"
            fill="black"
          />
        </svg>
      ) : (
        <svg
          width="26px"
          height="26px"
          viewBox="0 0 1024 1024"
          fill="var(--main-dark)"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M176.662 817.173c-8.19 8.471-7.96 21.977 0.51 30.165 8.472 8.19 21.978 7.96 30.166-0.51l618.667-640c8.189-8.472 7.96-21.978-0.511-30.166-8.471-8.19-21.977-7.96-30.166 0.51l-618.666 640z"
            fill=""
          />
          <path
            d="M795.328 846.827c8.19 8.471 21.695 8.7 30.166 0.511 8.471-8.188 8.7-21.694 0.511-30.165l-618.667-640c-8.188-8.471-21.694-8.7-30.165-0.511-8.471 8.188-8.7 21.694-0.511 30.165l618.666 640z"
            fill=""
          />
        </svg>
      )}
    </button>
  );
}
